app/controllers/endpoints_controller.rb

  def create
    project = Project.where(:id => params[:projectid]).first

    if project != nil
      blob = JSON.parse(params[:blob])

      item = Item.new(:name => blob['key'],
                      :keytype => blob['type'].downcase)
      item.save

      endpoint = Endpoint.new(:name => params[:name])
      endpoint.project = project
      endpoint.item = item
      endpoint.save
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 2 LIMIT 1
INSERT INTO "items" ("blueprint_id", "created_at", "dictionary_id", "erray_id", "keytype", "name", "parent_id", "updated_at", "value") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "endpoints" ("created_at", "dictionary_id", "item_id", "name", "project_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 18 Nov 2012 04:48:24 UTC +00:00], ["dictionary_id", nil], ["item_id", 1], ["name", "ABC"], ["project_id", 1], ["updated_at", Sun, 18 Nov 2012 04:48:24 UTC +00:00]]

  def get_endpoints
    array = Endpoint.joins(:item).where(:items => { :keytype => 'blueprint' })
---
SELECT "endpoints".* FROM "endpoints" INNER JOIN "items" ON "items"."id" = "endpoints"."item_id" WHERE "items"."keytype" = 'blueprint'

  def create_instance
    #endpoint = Endpoint.where(:id => params[:endpointid]).first
    blueprint = Item.where(:name => params[:blueprintname]).first

    data = JSON.parse(params[:data])

    puts 'HASH HERE!'
    puts data

    d = Dictionary.create!
    #create_dictionary(item, blob)

    item = Item.new(:name => nil,
                    :keytype => 'instance')
    item.blueprint = blueprint
    item.dictionary = d
    item.save
---
SELECT "items".* FROM "items" WHERE "items"."name" = 'blogpost' LIMIT 1
INSERT INTO "dictionaries" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sun, 18 Nov 2012 08:28:15 UTC +00:00], ["updated_at", Sun, 18 Nov 2012 08:28:15 UTC +00:00]]
INSERT INTO "items" ("blueprint_id", "created_at", "dictionary_id", "erray_id", "keytype", "name", "updated_at", "value") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def get_render
    endpoint = Endpoint.where(:id => params[:id]).first
---
SELECT "endpoints".* FROM "endpoints" WHERE "endpoints"."id" = 1 LIMIT 1