app/controllers/projects_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
INSERT INTO "projects" ("created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sat, 17 Nov 2012 21:12:15 UTC +00:00], ["name", "Krapp"], ["updated_at", Sat, 17 Nov 2012 21:12:15 UTC +00:00], ["user_id", 3]]
---
  def create
    user = User.where(:id => params[:userid]).first

    if user != nil
      project = Project.new(:name => params[:name])
      project.user = user
      project.save

SELECT "projects".* FROM "projects" WHERE "projects"."id" = 2 LIMIT 1
---
  def get
    project = Project.where(:id => params[:id]).first