app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "image", "name", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 17 Nov 2012 21:04:59 UTC +00:00], ["image", nil], ["name", "dan"], ["provider", nil], ["uid", nil], ["updated_at", Sat, 17 Nov 2012 21:04:59 UTC +00:00]]
---
  def create
    user = User.create!(:name => params[:name])

SELECT "users".* FROM "users" WHERE "users"."name" = 'ashish' LIMIT 1
---
  def get
    user = User.where(:name => params[:name]).first